website/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(twitch_profile_name: params[:session][:twitch_profile_name])
---
SELECT  "users".* FROM "users" WHERE "users"."twitch_profile_name" = ? LIMIT ?  [["twitch_profile_name", "glitch"], ["LIMIT", 1]]