app/views/games/index.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."game_id" = ? ORDER BY "categories"."id" ASC LIMIT ?  [["game_id", "Super Mario 64"], ["LIMIT", 1]]
---
        <td class="times">
          <% (Category.where(game_id: game.name)).each do |category| %>