app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("game_id", "cat_name", "time", "video_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["game_id", "Super Mario 64"], ["cat_name", "16 Star"], ["time", 1050], ["video_url", "6-agF6rcktM"], ["created_at", "2018-02-14 04:57:14.834870"], ["updated_at", "2018-02-14 04:57:14.834870"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "video_url" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["video_url", "=O-d1ponqdOk"], ["updated_at", "2018-02-14 05:05:11.451398"], ["id", 2]]