app/controllers/donations_controller.rb

SELECT "donations".* FROM "donations"
---
  def index
    @donations = Donation.all

INSERT INTO "donations" ("progress", "total", "incentive", "created_at", "updated_at", "image_url") VALUES (?, ?, ?, ?, ?, ?)  [["progress", 12.0], ["total", 42.0], ["incentive", "Thing"], ["created_at", "2018-02-22 07:16:55.142241"], ["updated_at", "2018-02-22 07:16:55.142241"], ["image_url", "smslogo.png"]]
---
  def create
    @donation = Donation.new(donation_params)

    respond_to do |format|
      if @donation.save

UPDATE "donations" SET "incentive" = ?, "updated_at" = ? WHERE "donations"."id" = ?  [["incentive", "Drinking Stream"], ["updated_at", "2018-03-01 04:13:10.315636"], ["id", 95]]
---
  def update
    respond_to do |format|
      if @donation.update(donation_params)

DELETE FROM "donations" WHERE "donations"."id" = ?  [["id", 29]]
---
  def destroy
    @donation.destroy

SELECT  "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
---
    def set_donation
      @donation = Donation.find(params[:id])