app/controllers/games_controller.rb

INSERT INTO "games" ("name", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Super Mario 64"], ["image_url", "sm64logo.png"], ["created_at", "2018-01-28 06:15:53.499913"], ["updated_at", "2018-01-28 06:15:53.499913"]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

UPDATE "games" SET "image_url" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["image_url", "papermario.png"], ["updated_at", "2018-02-01 23:34:49.824300"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @game.update(game_params)