app/controllers/heros_controller.rb

SELECT "heros".* FROM "heros"
---
  def index
    @heros = Hero.all

INSERT INTO "heros" ("name", "total", "unlocks", "image_url", "string", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Orisa"], ["total", 80], ["unlocks", 40], ["image_url", "Orisa.png"], ["string", ""], ["created_at", "2018-01-29 11:49:31.921020"], ["updated_at", "2018-01-29 11:49:31.921020"]]
---
  def create
    @hero = Hero.new(hero_params)

    respond_to do |format|
      if @hero.save

SELECT  "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "heros" SET "unlocks" = COALESCE("unlocks", 0) + 1 WHERE "heros"."id" = ?  [["id", 36]]
---
  def add
    @hero = Hero.find(params[:hero_id])
    @hero.increment!(:unlocks)

UPDATE "heros" SET "total" = ?, "unlocks" = ?, "updated_at" = ? WHERE "heros"."id" = ?  [["total", 84], ["unlocks", 41], ["updated_at", "2018-02-17 00:18:09.097422"], ["id", 73]]
---
  def update
    respond_to do |format|
      if @hero.update(hero_params)

SELECT  "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
---
  def set_hero
    @hero = Hero.find(params[:id])