app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("twitch_profile_name", "display_name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)